[
  {
    "id": 1,
    "title": "Blade Runner",
    "year": 1982,
    "genres": [
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 8.2,
    "youtubeTrailerId": "iYhJ7Mf2Oxs",
    "image": "images/movie/movie1.jpg",
    "plot": "In the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a \"Blade Runner\". Blade runners are people assigned to assassinate \"replicants\". The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human."
  },
  {
    "id": 2,
    "title": "The Cabin in the Woods",
    "year": 2012,
    "genres": [
      "Fantasy",
      "Horror",
      "Mystery"
    ],
    "rating": 7.0,
    "youtubeTrailerId": "_Itzujv4JwU",
    "image": "images/movie/movie2.jpg",
    "plot": "Five teenagers head off for a weekend at a secluded cabin in the woods. They arrive to find they are quite isolated with no means of communicating with the outside world. When the cellar door flings itself open, they of course go down to investigate. They find an odd assortment of relics and curios, but when one of the women, Dana, reads from a book, she awakens a family of deadly zombie killers. However, there's far more going on than meets the eye."
  },
  {
    "id": 3,
    "title": "Event Horizon",
    "year": 1997,
    "genres": [
      "Horror",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 6.7,
    "youtubeTrailerId": "OVlnER8SxfQ",
    "image": "images/movie/movie3.jpg",
    "plot": "In the year 2047 a group of astronauts are sent to investigate and salvage the long lost starship \"Event Horizon\". The ship disappeared mysteriously 7 years before on its maiden voyage and with its return comes even more mystery as the crew of the \"Lewis and Clark\" discover the real truth behind its disappearance and something even more terrifying."
  },
  {
    "id": 4,
    "title": "Star Wars: Episode VII - The Force Awakens",
    "year": 2015,
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "rating": 8.2,
    "youtubeTrailerId": "sGbxmsDFVnE",
    "image": "images/movie/movie4.jpg",
    "plot": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order."
  },
  {
    "id": 5,
    "title": "Ghost Busters",
    "year": 1984,
    "genres": [
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "rating": 7.8,
    "youtubeTrailerId": "vntAEVjPBzQ",
    "image": "images/movie/movie5.jpg",
    "plot": "Three odd-ball scientists get kicked out of their cushy positions at a university in New York City where they studied the occult. They decide to set up shop in an old firehouse and become Ghostbusters, trapping pesky ghosts, spirits, haunts, and poltergeists for money. They wise-crack their way through the city, and stumble upon a gateway to another dimension, one which will release untold evil upon the city. The Ghostbusters are called on to save the Big Apple."
  },
  {
    "id": 6,
    "title": "Guardians of the Galaxy Vol. 2",
    "year": 2017,
    "genres": [
      "Action",
      "Adventure",
      "Sci-Fi"
    ],
    "rating": 8.6,
    "youtubeTrailerId": "sMTntxvok1M",
    "image": "images/movie/movie6.jpg",
    "plot": "Set to the backdrop of 'Awesome Mixtape #2,' Marvel's Guardians of the Galaxy Vol. 2 continues the team's adventures as they traverse the outer reaches of the cosmos. The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage. Old foes become new allies and fan-favorite characters from the classic comics will come to our heroes' aid as the Marvel cinematic universe continues to expand."
  },
  {
    "id": 7,
    "title": "Dredd",
    "year": 2012,
    "genres": [
      "Action",
      "Sci-Fi"
    ],
    "rating": 7.1,
    "youtubeTrailerId": "G-eI5oLlIeY",
    "image": "images/movie/movie7.jpg",
    "plot": "The future America is an irradiated waste land. On its East Coast, running from Boston to Washington DC, lies Mega City One - a vast, violent metropolis where criminals rule the chaotic streets. The only force of order lies with the urban cops called «Judges» who possess the combined powers of judge, jury and instant executioner. Known and feared throughout the city, Dredd is the ultimate Judge, challenged with ridding the city of its latest scourge - a dangerous drug epidemic that has users of «Slo-Mo» experiencing reality at a fraction of its normal speed. During a routine day on the job, Dredd is assigned to train and evaluate Cassandra Anderson, a rookie with powerful psychic abilities thanks to a genetic mutation. A heinous crime calls them to a neighborhood where fellow Judges rarely dare to venture - a 200 storey vertical slum controlled by prostitute turned drug lord Ma-Ma and her ruthless clan. When they capture one of the clan's inner circle, Ma-Ma overtakes the compound's control center and wages a dirty, vicious war against the Judges that proves she will stop at nothing to protect her empire. With the body count climbing and no way out, Dredd and Anderson must confront the odds and engage in the relentless battle for their survival."
  },
  {
    "id": 8,
    "title": "Ex Machina",
    "year": 2014,
    "genres": [
      "Drama",
      "Mystery",
      "Sci-Fi"
    ],
    "rating": 7.7,
    "youtubeTrailerId": "EoQuVnKhxaM",
    "image": "images/movie/movie8.jpg",
    "plot": "A junior programmer working at the company that runs the world's most popular search engine wins a company lottery. The prize is a week at the CEO's estate/research facility. When he gets there he discovers that the boss has been working on androids with superior Artificial Intelligence. The programmers job is to test how 'human' the android is. What develops is a manipulative game between the android and the programmer."
  },
  {
    "id": 9,
    "title": "The Lego Movie",
    "year": 2014,
    "genres": [
      "Animation",
      "Action",
      "Adventure"
    ],
    "rating": 7.8,
    "youtubeTrailerId": "fZ_JOBCLF-I",
    "image": "images/movie/movie9.jpg",
    "plot": "The evil plans of Lord Business to ensure order in his world with a powerful weapon is in jeopardy as a prophecy about 'Special' comes true with the discovery of 'Piece of Resistance'. With odds like Bad Cop, Micro managers and 'Man from upstairs' stacked against him during his journey to save the world; Emmett, a construction worker, has a long way to go before he succeeds."
  },
  {
    "id": 10,
    "title": "Shoot 'Em Up",
    "year": 2007,
    "genres": [
      "Action",
      "Comedy",
      "Crime"
    ],
    "rating": 6.7,
    "youtubeTrailerId": "zV-nIlZ3XeE",
    "image": "images/movie/movie10.jpg",
    "plot": "Late at night, in an unnamed U.S. city, a solitary man sits at a bus stop. A pregnant woman runs by, pursued by a man with a gun. With reluctance, the man at the bus stop rescues her and assists with the baby's delivery, while additional pursuers fire at them, including the gang's particularly nasty leader, an intuitive man named Hertz. Our hero, known only as Smith, determines to save the child and find out why Hertz wants the baby dead. At a local bordello, he tries to employ a lactating hooker to watch the child, but things quickly escalate, and this makeshift family is soon on the run. Heavy metal music calms the baby. Why? A laboratory, gun factory, and presidential campaign all figure in Smith's quest for the child's safe deliverance."
  },
  {
    "id": 11,
    "title": "Back to the Future",
    "year": 1985,
    "genres": [
      "Adventure",
      "Comedy",
      "Sci-Fi"
    ],
    "rating": 8.5,
    "youtubeTrailerId": "qvsgGtivCgs",
    "image": "images/movie/movie11.jpg",
    "plot": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future. "
  }
]